
{

"accueilView":[
    {
        "titre": "Bienvenue à La Pépinière !",
        "text": "Découvrez un espace où la nature prend vie et s'épanouit. Que vous soyez un amateur de jardinage ou un professionnel du paysage, notre pépinière vous offre une vaste sélection de plantes, d'arbres et d'arbustes de qualité supérieure. Laissez-vous inspirer par notre passion pour la verdure et transformez votre jardin en un véritable havre de paix."
    }
    ],

    "produits": [
    {
        "id":1,
        "nom": "Rosier Éternel",
        "description": "Un rosier classique aux fleurs rouges éclatantes, parfait pour ajouter une touche romantique à votre jardin. Résistant aux maladies et facile d'entretien, il fleurit tout au long de l'été.",
        "prix": 29.99,
        "wikipedia" : " https://fr.'wikipedia'.org/wiki/Rosier",        
        "categories": "arbre",
        "stock": 5
    },
    {
        "id":2,
        "nom" : "Érable à Sucre",
        "description" : "L'érable à sucre est un arbre emblématique du Canada, connu pour ses magnifiques couleurs automnales et son sirop d'érable. Il peut atteindre une hauteur de 25 à 35 mètres, idéal pour les grands jardins.",
        "prix" : 79.99,
        "wikipedia" : "https://fr.'wikipedia'.org/wiki/%C3%89rable_%C3%A0_sucre",  
        "categories" : "arbre",
        "stock" : 5
    },
    {
        "id":3,
        "nom" : "Sapin de Douglas",
        "description" : "Un conifère majestueux, souvent utilisé comme arbre de Noël. Le sapin de Douglas est apprécié pour son bois durable et son port élancé. Il est également parfait pour créer des haies naturelles.",
        "prix" : 99.99,
        "wikipedia" : "https://fr.'wikipedia'.org/wiki/Pseudotsuga_menziesii",  
        "categories" : "arbre",
        "stock" : 5
    },
    {
        "id":4,
        "nom" : "Chêne Rouge",
        "description" : "Ce chêne robuste est célèbre pour son bois précieux et sa longévité. Il offre un magnifique feuillage rouge en automne et peut vivre plusieurs siècles. Parfait pour apporter une touche de grandeur à votre jardin.",
        "prix" : 89.99,
        "wikipedia" : "https://fr.'wikipedia'.org/wiki/Ch%C3%AAne_rouge_d%27Am%C3%A9rique",  
        "categories" : "arbre",
        "stock" : 5
    },
    {
        "id":5,
        "nom" : "Cerisier à Fleurs",
        "description" : "Aussi connu sous le nom de cerisier japonais, cet arbre est célèbre pour ses magnifiques fleurs roses ou blanches au printemps. idéal pour les petits jardins, il apporte une touche de beauté éphémère et délicate.",
        "prix" : 69.99,
        "wikipedia" : "https://fr.'wikipedia'.org/wiki/Cerisier",  
        "categories" : "arbre",
        "stock" : 5
    },
    {
        "id":6,
        "nom" : "Saule Pleureur",
        "description" : "Le saule pleureur est un arbre majestueux, reconnu pour ses longues branches tombantes. Il est parfait pour les zones humides et offre un cadre romantique près d'un étang ou d'un cours d'eau.",
        "prix" : 89.99,
        "wikipedia" : "https://fr.'wikipedia'.org/wiki/Saule_pleureur",  
        "categories" : "arbre",
        "stock" : 5
    },{
        "id":7,
        "nom" : "Magnolia",
        "description" : "Le magnolia est apprécié pour ses grandes fleurs parfumées qui apparaissent au printemps. Il est souvent planté comme arbre ornemental dans les jardins, où il attire l'œil par sa floraison spectaculaire.",
        "prix" : 79.99,
        "wikipedia" : "https://fr.'wikipedia'.org/wiki/Magnolia",  
        "categories" : "arbre",
        "stock" : 5
    },
    {
        "id":8,
        "nom" : "Bouleau Blanc",
        "description" : "Ce bel arbre à l'écorce blanche et lisse est un excellent choix pour apporter de la luminosité à un jardin. Le bouleau blanc pousse rapidement et est résistant aux conditions froides.",
        "prix" : 74.99,
        "wikipedia" : "https://fr.'wikipedia'.org/wiki/Bouleau_%C3%A0_papier",  
        "categories" : "arbre",
        "stock" : 5
    },
    {
        "id":9,
        "nom" : "Reine des Neiges",
        "description" : "Cette variété de rose blanche, également connue sous le nom de 'Reine des Neiges', est réputée pour sa floraison abondante et continue. Ses fleurs parfumées et élégantes illuminent les jardins du printemps à l'automne. Parfaite pour créer des massifs fleuris ou des haies parfumées.",
        "prix" : 24.99,
        "wikipedia" : "https://fr.'wikipedia'.org/wiki/Edelweiss",  
        "categories" : "fleur",
        "stock" : 5
    },
    {
        "id":10,
        "nom" : "La lavande",
        "description" : "La lavande 'Grosso' est une plante aromatique au parfum envoûtant, appréciée pour ses épis de fleurs violettes. idéale pour les jardins secs et ensoleillés, elle attire les abeilles et papillons, tout en étant résistante à la sécheresse. Parfaite pour des bordures ou en pot.",
        "prix" : 14.99,
        "wikipedia" : "https://fr.'wikipedia'.org/wiki/Lavande",  
        "categories" : "fleur",
        "stock" : 5
    },
    {
        "id":11,
        "nom": "Pelle",
        "description": "Pelle de jardin robuste et durable, idéale pour creuser, planter et remuer la terre. Conception ergonomique pour un confort d'utilisation optimal.",
        "prix": 14.99,
        "wikipedia" : "https://fr.'wikipedia'.org/wiki/Pelle_(outil)",  
        "categories": "materiel",
        "stock": 20
    },
    {
        "id":12,
        "nom": "Terre",
        "description": "Terre de qualité supérieure, parfait pour enrichir le sol de votre jardin et améliorer la croissance de vos plantes. Convient pour tous les types de plantes et de fleurs.",
        "prix": 9.99,
        "wikipedia" : "https://fr.'wikipedia'.org/wiki/Terreau",  
        "categories": "materiel",
        "stock": 30
    }]
}